---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.InvalidSlantedColumnOffsets
source: html/cb2d168c-4e06-273b-54ad-fee2aca5f6ff.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.InvalidSlantedColumnOffsets Property

The column's base (Base Level + Base Offset) must be below its top (Top Level + Top Offset).

## Syntax (C#)
```csharp
public static FailureDefinitionId InvalidSlantedColumnOffsets { get; }
```